stm32duino/ISM330DHCX/src/ism330dhcx_reg.h
#define ISM330DHCX_INT_DUR2                     0x5AU
typedef struct {
  uint8_t shock                    : 2;
  uint8_t quiet                    : 2;
  uint8_t dur                      : 4;
} ism330dhcx_int_dur2_t;

#define ISM330DHCX_WAKE_UP_THS                  0x5BU
typedef struct {
  uint8_t wk_ths                   : 6;
  uint8_t usr_off_on_wu            : 1;
  uint8_t single_double_tap        : 1;
} ism330dhcx_wake_up_ths_t;

#define ISM330DHCX_WAKE_UP_DUR                  0x5CU
typedef struct {
  uint8_t sleep_dur                : 4;
  uint8_t wake_ths_w               : 1;
  uint8_t wake_dur                 : 2;
  uint8_t ff_dur                   : 1;
} ism330dhcx_wake_up_dur_t;

#define ISM330DHCX_FREE_FALL                    0x5DU
typedef struct {
  uint8_t ff_ths                   : 3;
  uint8_t ff_dur                   : 5;
} ism330dhcx_free_fall_t;

#define ISM330DHCX_MD1_CFG                      0x5EU
typedef struct {
  uint8_t int1_shub                : 1;
  uint8_t int1_emb_func            : 1;
  uint8_t int1_6d                  : 1;
  uint8_t int1_double_tap          : 1;
  uint8_t int1_ff                  : 1;
  uint8_t int1_wu                  : 1;
  uint8_t int1_single_tap          : 1;
  uint8_t int1_sleep_change        : 1;
} ism330dhcx_md1_cfg_t;

#define ISM330DHCX_MD2_CFG                      0x5FU
typedef struct {
  uint8_t int2_timestamp           : 1;
  uint8_t int2_emb_func            : 1;
  uint8_t int2_6d                  : 1;
  uint8_t int2_double_tap          : 1;
  uint8_t int2_ff                  : 1;
  uint8_t int2_wu                  : 1;
  uint8_t int2_single_tap          : 1;
  uint8_t int2_sleep_change        : 1;
} ism330dhcx_md2_cfg_t;

#define ISM330DHCX_INTERNAL_FREQ_FINE           0x63U
typedef struct {
  uint8_t freq_fine                : 8;
} ism330dhcx_internal_freq_fine_t;

#define ISM330DHCX_INT_OIS                      0x6FU
typedef struct {
  uint8_t st_xl_ois                : 2;
  uint8_t not_used_01              : 3;
  uint8_t den_lh_ois               : 1;
  uint8_t lvl2_ois                 : 1;
  uint8_t int2_drdy_ois            : 1;
} ism330dhcx_int_ois_t;

#define ISM330DHCX_CTRL1_OIS                    0x70U
typedef struct {
  uint8_t ois_en_spi2              : 1;
  uint8_t fs_125_ois               : 1;
  uint8_t fs_g_ois                 : 2;
  uint8_t mode4_en                 : 1;
  uint8_t sim_ois                  : 1;
  uint8_t lvl1_ois                 : 1;
  uint8_t not_used_01              : 1;
} ism330dhcx_ctrl1_ois_t;

#define ISM330DHCX_CTRL2_OIS                    0x71U
typedef struct {
  uint8_t hp_en_ois                : 1;
  uint8_t ftype_ois                : 2;
  uint8_t not_used_01              : 1;
  uint8_t hpm_ois                  : 2;
  uint8_t not_used_02              : 2;
} ism330dhcx_ctrl2_ois_t;

#define ISM330DHCX_CTRL3_OIS                    0x72U
typedef struct {
  uint8_t st_ois_clampdis          : 1;
  uint8_t st_ois                   : 2;
  uint8_t filter_xl_conf_ois       : 3;
  uint8_t fs_xl_ois                : 2;
} ism330dhcx_ctrl3_ois_t;

#define ISM330DHCX_X_OFS_USR                    0x73U
#define ISM330DHCX_Y_OFS_USR                    0x74U
#define ISM330DHCX_Z_OFS_USR                    0x75U
#define ISM330DHCX_FIFO_DATA_OUT_TAG            0x78U
typedef struct {
  uint8_t tag_parity               : 1;
  uint8_t tag_cnt                  : 2;
  uint8_t tag_sensor               : 5;
} ism330dhcx_fifo_data_out_tag_t;

#define ISM330DHCX_FIFO_DATA_OUT_X_L            0x79U
#define ISM330DHCX_FIFO_DATA_OUT_X_H            0x7AU
#define ISM330DHCX_FIFO_DATA_OUT_Y_L            0x7BU
#define ISM330DHCX_FIFO_DATA_OUT_Y_H            0x7CU
#define ISM330DHCX_FIFO_DATA_OUT_Z_L            0x7DU
#define ISM330DHCX_FIFO_DATA_OUT_Z_H            0x7EU
#define ISM330DHCX_PAGE_SEL                     0x02U
typedef struct {
  uint8_t not_used_01              : 4;
  uint8_t page_sel                 : 4;
} ism330dhcx_page_sel_t;

#define ISM330DHCX_ADV_PEDO                     0x03U
typedef struct {
  uint8_t not_used_01              : 1;
  uint8_t pedo_fpr_adf_dis         : 1;
  uint8_t not_used_02              : 6;
} ism330dhcx_adv_pedo_t;

#define ISM330DHCX_EMB_FUNC_EN_A                0x04U
typedef struct {
  uint8_t not_used_01              : 3;
  uint8_t pedo_en                  : 1;
  uint8_t tilt_en                  : 1;
  uint8_t sign_motion_en           : 1;
  uint8_t not_used_02              : 2;
} ism330dhcx_emb_func_en_a_t;

#define ISM330DHCX_EMB_FUNC_EN_B                0x05U
typedef struct {
  uint8_t fsm_en                   : 1;
  uint8_t not_used_01              : 2;
  uint8_t fifo_compr_en            : 1;
  uint8_t mlc_en                   : 1;
  uint8_t not_used_02              : 3;
} ism330dhcx_emb_func_en_b_t;

#define ISM330DHCX_PAGE_ADDRESS                 0x08U
typedef struct {
  uint8_t page_addr                : 8;
} ism330dhcx_page_address_t;

#define ISM330DHCX_PAGE_VALUE                   0x09U
typedef struct {
  uint8_t page_value               : 8;
} ism330dhcx_page_value_t;

#define ISM330DHCX_EMB_FUNC_INT1                0x0AU
typedef struct {
  uint8_t not_used_01              : 3;
  uint8_t int1_step_detector       : 1;
  uint8_t int1_tilt                : 1;
  uint8_t int1_sig_mot             : 1;
  uint8_t not_used_02              : 1;
  uint8_t int1_fsm_lc              : 1;
} ism330dhcx_emb_func_int1_t;

#define ISM330DHCX_FSM_INT1_A                   0x0BU
typedef struct {
  uint8_t int1_fsm1                : 1;
  uint8_t int1_fsm2                : 1;
  uint8_t int1_fsm3                : 1;
  uint8_t int1_fsm4                : 1;
  uint8_t int1_fsm5                : 1;
  uint8_t int1_fsm6                : 1;
  uint8_t int1_fsm7                : 1;
  uint8_t int1_fsm8                : 1;
} ism330dhcx_fsm_int1_a_t;

#define ISM330DHCX_FSM_INT1_B                   0x0CU
typedef struct {
  uint8_t int1_fsm9                : 1;
  uint8_t int1_fsm10               : 1;
  uint8_t int1_fsm11               : 1;
  uint8_t int1_fsm12               : 1;
  uint8_t int1_fsm13               : 1;
  uint8_t int1_fsm14               : 1;
  uint8_t int1_fsm15               : 1;
  uint8_t int1_fsm16               : 1;
} ism330dhcx_fsm_int1_b_t;

#define ISM330DHCX_MLC_INT1                     0x0DU
typedef struct {
  uint8_t int1_mlc1                : 1;
  uint8_t int1_mlc2                : 1;
  uint8_t int1_mlc3                : 1;
  uint8_t int1_mlc4                : 1;
  uint8_t int1_mlc5                : 1;
  uint8_t int1_mlc6                : 1;
  uint8_t int1_mlc7                : 1;
  uint8_t int1_mlc8                : 1;
} ism330dhcx_mlc_int1_t;

#define ISM330DHCX_EMB_FUNC_INT2                0x0EU
typedef struct {
  uint8_t not_used_01              : 3;
  uint8_t int2_step_detector       : 1;
  uint8_t int2_tilt                : 1;
  uint8_t int2_sig_mot             : 1;
  uint8_t not_used_02              : 1;
  uint8_t int2_fsm_lc              : 1;
} ism330dhcx_emb_func_int2_t;

#define ISM330DHCX_FSM_INT2_A                   0x0FU
typedef struct {
  uint8_t int2_fsm1                : 1;
  uint8_t int2_fsm2                : 1;
  uint8_t int2_fsm3                : 1;
  uint8_t int2_fsm4                : 1;
  uint8_t int2_fsm5                : 1;
  uint8_t int2_fsm6                : 1;
  uint8_t int2_fsm7                : 1;
  uint8_t int2_fsm8                : 1;
} ism330dhcx_fsm_int2_a_t;

#define ISM330DHCX_FSM_INT2_B                   0x10U
typedef struct {
  uint8_t int2_fsm9                : 1;
  uint8_t int2_fsm10               : 1;
  uint8_t int2_fsm11               : 1;
  uint8_t int2_fsm12               : 1;
  uint8_t int2_fsm13               : 1;
  uint8_t int2_fsm14               : 1;
  uint8_t int2_fsm15               : 1;
  uint8_t int2_fsm16               : 1;
} ism330dhcx_fsm_int2_b_t;

