stm32duino/ISM330DHCX/src/ism330dhcx_reg.h
#define ISM330DHCX_SENSOR_HUB_3                 0x04U
typedef struct {
  uint8_t bit0                    : 1;
  uint8_t bit1                    : 1;
  uint8_t bit2                    : 1;
  uint8_t bit3                    : 1;
  uint8_t bit4                    : 1;
  uint8_t bit5                    : 1;
  uint8_t bit6                    : 1;
  uint8_t bit7                    : 1;
} ism330dhcx_sensor_hub_3_t;

#define ISM330DHCX_SENSOR_HUB_4                 0x05U
typedef struct {
  uint8_t bit0                    : 1;
  uint8_t bit1                    : 1;
  uint8_t bit2                    : 1;
  uint8_t bit3                    : 1;
  uint8_t bit4                    : 1;
  uint8_t bit5                    : 1;
  uint8_t bit6                    : 1;
  uint8_t bit7                    : 1;
} ism330dhcx_sensor_hub_4_t;

#define ISM330DHCX_SENSOR_HUB_5                 0x06U
typedef struct {
  uint8_t bit0                    : 1;
  uint8_t bit1                    : 1;
  uint8_t bit2                    : 1;
  uint8_t bit3                    : 1;
  uint8_t bit4                    : 1;
  uint8_t bit5                    : 1;
  uint8_t bit6                    : 1;
  uint8_t bit7                    : 1;
} ism330dhcx_sensor_hub_5_t;

#define ISM330DHCX_SENSOR_HUB_6                 0x07U
typedef struct {
  uint8_t bit0                    : 1;
  uint8_t bit1                    : 1;
  uint8_t bit2                    : 1;
  uint8_t bit3                    : 1;
  uint8_t bit4                    : 1;
  uint8_t bit5                    : 1;
  uint8_t bit6                    : 1;
  uint8_t bit7                    : 1;
} ism330dhcx_sensor_hub_6_t;

#define ISM330DHCX_SENSOR_HUB_7                 0x08U
typedef struct {
  uint8_t bit0                    : 1;
  uint8_t bit1                    : 1;
  uint8_t bit2                    : 1;
  uint8_t bit3                    : 1;
  uint8_t bit4                    : 1;
  uint8_t bit5                    : 1;
  uint8_t bit6                    : 1;
  uint8_t bit7                    : 1;
} ism330dhcx_sensor_hub_7_t;

#define ISM330DHCX_SENSOR_HUB_8                 0x09U
typedef struct {
  uint8_t bit0                    : 1;
  uint8_t bit1                    : 1;
  uint8_t bit2                    : 1;
  uint8_t bit3                    : 1;
  uint8_t bit4                    : 1;
  uint8_t bit5                    : 1;
  uint8_t bit6                    : 1;
  uint8_t bit7                    : 1;
} ism330dhcx_sensor_hub_8_t;

#define ISM330DHCX_SENSOR_HUB_9                 0x0AU
typedef struct {
  uint8_t bit0                    : 1;
  uint8_t bit1                    : 1;
  uint8_t bit2                    : 1;
  uint8_t bit3                    : 1;
  uint8_t bit4                    : 1;
  uint8_t bit5                    : 1;
  uint8_t bit6                    : 1;
  uint8_t bit7                    : 1;
} ism330dhcx_sensor_hub_9_t;

#define ISM330DHCX_SENSOR_HUB_10                0x0BU
typedef struct {
  uint8_t bit0                    : 1;
  uint8_t bit1                    : 1;
  uint8_t bit2                    : 1;
  uint8_t bit3                    : 1;
  uint8_t bit4                    : 1;
  uint8_t bit5                    : 1;
  uint8_t bit6                    : 1;
  uint8_t bit7                    : 1;
} ism330dhcx_sensor_hub_10_t;

#define ISM330DHCX_SENSOR_HUB_11                0x0CU
typedef struct {
  uint8_t bit0                    : 1;
  uint8_t bit1                    : 1;
  uint8_t bit2                    : 1;
  uint8_t bit3                    : 1;
  uint8_t bit4                    : 1;
  uint8_t bit5                    : 1;
  uint8_t bit6                    : 1;
  uint8_t bit7                    : 1;
} ism330dhcx_sensor_hub_11_t;

#define ISM330DHCX_SENSOR_HUB_12                0x0DU
typedef struct {
  uint8_t bit0                    : 1;
  uint8_t bit1                    : 1;
  uint8_t bit2                    : 1;
  uint8_t bit3                    : 1;
  uint8_t bit4                    : 1;
  uint8_t bit5                    : 1;
  uint8_t bit6                    : 1;
  uint8_t bit7                    : 1;
} ism330dhcx_sensor_hub_12_t;

#define ISM330DHCX_SENSOR_HUB_13                0x0EU
typedef struct {
  uint8_t bit0                    : 1;
  uint8_t bit1                    : 1;
  uint8_t bit2                    : 1;
  uint8_t bit3                    : 1;
  uint8_t bit4                    : 1;
  uint8_t bit5                    : 1;
  uint8_t bit6                    : 1;
  uint8_t bit7                    : 1;
} ism330dhcx_sensor_hub_13_t;

#define ISM330DHCX_SENSOR_HUB_14                0x0FU
typedef struct {
  uint8_t bit0                    : 1;
  uint8_t bit1                    : 1;
  uint8_t bit2                    : 1;
  uint8_t bit3                    : 1;
  uint8_t bit4                    : 1;
  uint8_t bit5                    : 1;
  uint8_t bit6                    : 1;
  uint8_t bit7                    : 1;
} ism330dhcx_sensor_hub_14_t;

#define ISM330DHCX_SENSOR_HUB_15                0x10U
typedef struct {
  uint8_t bit0                    : 1;
  uint8_t bit1                    : 1;
  uint8_t bit2                    : 1;
  uint8_t bit3                    : 1;
  uint8_t bit4                    : 1;
  uint8_t bit5                    : 1;
  uint8_t bit6                    : 1;
  uint8_t bit7                    : 1;
} ism330dhcx_sensor_hub_15_t;

#define ISM330DHCX_SENSOR_HUB_16                0x11U
typedef struct {
  uint8_t bit0                    : 1;
  uint8_t bit1                    : 1;
  uint8_t bit2                    : 1;
  uint8_t bit3                    : 1;
  uint8_t bit4                    : 1;
  uint8_t bit5                    : 1;
  uint8_t bit6                    : 1;
  uint8_t bit7                    : 1;
} ism330dhcx_sensor_hub_16_t;

#define ISM330DHCX_SENSOR_HUB_17                0x12U
typedef struct {
  uint8_t bit0                    : 1;
  uint8_t bit1                    : 1;
  uint8_t bit2                    : 1;
  uint8_t bit3                    : 1;
  uint8_t bit4                    : 1;
  uint8_t bit5                    : 1;
  uint8_t bit6                    : 1;
  uint8_t bit7                    : 1;
} ism330dhcx_sensor_hub_17_t;

