stm32duino/ISM330DHCX/src/ism330dhcx_reg.h
typedef enum {
  ISM330DHCX_2g   = 0,
  ISM330DHCX_16g  = 1, /* if XL_FS_MODE = ‘1’ -> ISM330DHCX_2g */
  ISM330DHCX_4g   = 2,
  ISM330DHCX_8g   = 3,
} ism330dhcx_fs_xl_t;
int32_t ism330dhcx_xl_full_scale_set(ism330dhcx_ctx_t *ctx,
                                     ism330dhcx_fs_xl_t val);
int32_t ism330dhcx_xl_full_scale_get(ism330dhcx_ctx_t *ctx,
                                     ism330dhcx_fs_xl_t *val);

typedef enum {
  ISM330DHCX_XL_ODR_OFF    = 0,
  ISM330DHCX_XL_ODR_12Hz5  = 1,
  ISM330DHCX_XL_ODR_26Hz   = 2,
  ISM330DHCX_XL_ODR_52Hz   = 3,
  ISM330DHCX_XL_ODR_104Hz  = 4,
  ISM330DHCX_XL_ODR_208Hz  = 5,
  ISM330DHCX_XL_ODR_417Hz  = 6,
  ISM330DHCX_XL_ODR_833Hz  = 7,
  ISM330DHCX_XL_ODR_1667Hz = 8,
  ISM330DHCX_XL_ODR_3333Hz = 9,
  ISM330DHCX_XL_ODR_6667Hz = 10,
  ISM330DHCX_XL_ODR_6Hz5   = 11, /* (low power only) */
} ism330dhcx_odr_xl_t;
int32_t ism330dhcx_xl_data_rate_set(ism330dhcx_ctx_t *ctx,
                                    ism330dhcx_odr_xl_t val);
int32_t ism330dhcx_xl_data_rate_get(ism330dhcx_ctx_t *ctx,
                                    ism330dhcx_odr_xl_t *val);

typedef enum {
  ISM330DHCX_125dps = 2,
  ISM330DHCX_250dps = 0,
  ISM330DHCX_500dps = 4,
  ISM330DHCX_1000dps = 8,
  ISM330DHCX_2000dps = 12,
  ISM330DHCX_4000dps = 1,
} ism330dhcx_fs_g_t;
int32_t ism330dhcx_gy_full_scale_set(ism330dhcx_ctx_t *ctx,
                                     ism330dhcx_fs_g_t val);
int32_t ism330dhcx_gy_full_scale_get(ism330dhcx_ctx_t *ctx,
                                     ism330dhcx_fs_g_t *val);

typedef enum {
  ISM330DHCX_GY_ODR_OFF    = 0,
  ISM330DHCX_GY_ODR_12Hz5  = 1,
  ISM330DHCX_GY_ODR_26Hz   = 2,
  ISM330DHCX_GY_ODR_52Hz   = 3,
  ISM330DHCX_GY_ODR_104Hz  = 4,
  ISM330DHCX_GY_ODR_208Hz  = 5,
  ISM330DHCX_GY_ODR_417Hz  = 6,
  ISM330DHCX_GY_ODR_833Hz  = 7,
  ISM330DHCX_GY_ODR_1667Hz = 8,
  ISM330DHCX_GY_ODR_3333Hz = 9,
  ISM330DHCX_GY_ODR_6667Hz = 10,
} ism330dhcx_odr_g_t;
int32_t ism330dhcx_gy_data_rate_set(ism330dhcx_ctx_t *ctx,
                                    ism330dhcx_odr_g_t val);
int32_t ism330dhcx_gy_data_rate_get(ism330dhcx_ctx_t *ctx,
                                    ism330dhcx_odr_g_t *val);

int32_t ism330dhcx_block_data_update_set(ism330dhcx_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_block_data_update_get(ism330dhcx_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DHCX_LSb_1mg  = 0,
  ISM330DHCX_LSb_16mg = 1,
} ism330dhcx_usr_off_w_t;
int32_t ism330dhcx_xl_offset_weight_set(ism330dhcx_ctx_t *ctx,
                                        ism330dhcx_usr_off_w_t val);
int32_t ism330dhcx_xl_offset_weight_get(ism330dhcx_ctx_t *ctx,
                                        ism330dhcx_usr_off_w_t *val);

typedef enum {
  ISM330DHCX_HIGH_PERFORMANCE_MD  = 0,
  ISM330DHCX_LOW_NORMAL_POWER_MD  = 1,
} ism330dhcx_xl_hm_mode_t;
int32_t ism330dhcx_xl_power_mode_set(ism330dhcx_ctx_t *ctx,
                                     ism330dhcx_xl_hm_mode_t val);
int32_t ism330dhcx_xl_power_mode_get(ism330dhcx_ctx_t *ctx,
                                     ism330dhcx_xl_hm_mode_t *val);

typedef enum {
  ISM330DHCX_GY_HIGH_PERFORMANCE  = 0,
  ISM330DHCX_GY_NORMAL            = 1,
} ism330dhcx_g_hm_mode_t;
int32_t ism330dhcx_gy_power_mode_set(ism330dhcx_ctx_t *ctx,
                                     ism330dhcx_g_hm_mode_t val);
int32_t ism330dhcx_gy_power_mode_get(ism330dhcx_ctx_t *ctx,
                                     ism330dhcx_g_hm_mode_t *val);

typedef struct {
  ism330dhcx_all_int_src_t       all_int_src;
  ism330dhcx_wake_up_src_t       wake_up_src;
  ism330dhcx_tap_src_t           tap_src;
  ism330dhcx_d6d_src_t           d6d_src;
  ism330dhcx_status_reg_t        status_reg;
  ism330dhcx_emb_func_status_t   emb_func_status;
  ism330dhcx_fsm_status_a_t      fsm_status_a;
  ism330dhcx_fsm_status_b_t      fsm_status_b;
} ism330dhcx_all_sources_t;
int32_t ism330dhcx_all_sources_get(ism330dhcx_ctx_t *ctx,
                                   ism330dhcx_all_sources_t *val);

int32_t ism330dhcx_status_reg_get(ism330dhcx_ctx_t *ctx,
                                  ism330dhcx_status_reg_t *val);

int32_t ism330dhcx_xl_flag_data_ready_get(ism330dhcx_ctx_t *ctx,
                                          uint8_t *val);

int32_t ism330dhcx_gy_flag_data_ready_get(ism330dhcx_ctx_t *ctx,
                                          uint8_t *val);

int32_t ism330dhcx_temp_flag_data_ready_get(ism330dhcx_ctx_t *ctx,
                                            uint8_t *val);

int32_t ism330dhcx_xl_usr_offset_x_set(ism330dhcx_ctx_t *ctx, uint8_t *buff);
int32_t ism330dhcx_xl_usr_offset_x_get(ism330dhcx_ctx_t *ctx, uint8_t *buff);

int32_t ism330dhcx_xl_usr_offset_y_set(ism330dhcx_ctx_t *ctx, uint8_t *buff);
int32_t ism330dhcx_xl_usr_offset_y_get(ism330dhcx_ctx_t *ctx, uint8_t *buff);

int32_t ism330dhcx_xl_usr_offset_z_set(ism330dhcx_ctx_t *ctx, uint8_t *buff);
int32_t ism330dhcx_xl_usr_offset_z_get(ism330dhcx_ctx_t *ctx, uint8_t *buff);

int32_t ism330dhcx_xl_usr_offset_set(ism330dhcx_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_xl_usr_offset_get(ism330dhcx_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_timestamp_set(ism330dhcx_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_timestamp_get(ism330dhcx_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_timestamp_raw_get(ism330dhcx_ctx_t *ctx, uint8_t *buff);

typedef enum {
  ISM330DHCX_NO_ROUND      = 0,
  ISM330DHCX_ROUND_XL      = 1,
  ISM330DHCX_ROUND_GY      = 2,
  ISM330DHCX_ROUND_GY_XL   = 3,
} ism330dhcx_rounding_t;
int32_t ism330dhcx_rounding_mode_set(ism330dhcx_ctx_t *ctx,
                                     ism330dhcx_rounding_t val);
int32_t ism330dhcx_rounding_mode_get(ism330dhcx_ctx_t *ctx,
                                     ism330dhcx_rounding_t *val);

int32_t ism330dhcx_temperature_raw_get(ism330dhcx_ctx_t *ctx, uint8_t *buff);

int32_t ism330dhcx_angular_rate_raw_get(ism330dhcx_ctx_t *ctx, uint8_t *buff);

int32_t ism330dhcx_acceleration_raw_get(ism330dhcx_ctx_t *ctx, uint8_t *buff);

int32_t ism330dhcx_fifo_out_raw_get(ism330dhcx_ctx_t *ctx, uint8_t *buff);

int32_t ism330dhcx_odr_cal_reg_set(ism330dhcx_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_odr_cal_reg_get(ism330dhcx_ctx_t *ctx, uint8_t *val);

