stm32duino/ISM330DHCX/src/ism330dhcx_reg.h
int32_t ism330dhcx_number_of_steps_get(ism330dhcx_ctx_t *ctx, uint8_t *buff);

int32_t ism330dhcx_steps_reset(ism330dhcx_ctx_t *ctx);

typedef enum {
  ISM330DHCX_USER_BANK           = 0,
  ISM330DHCX_SENSOR_HUB_BANK     = 1,
  ISM330DHCX_EMBEDDED_FUNC_BANK  = 2,
} ism330dhcx_reg_access_t;
int32_t ism330dhcx_mem_bank_set(ism330dhcx_ctx_t *ctx,
                                ism330dhcx_reg_access_t val);
int32_t ism330dhcx_mem_bank_get(ism330dhcx_ctx_t *ctx,
                                ism330dhcx_reg_access_t *val);

int32_t ism330dhcx_ln_pg_write_byte(ism330dhcx_ctx_t *ctx, uint16_t address,
                                    uint8_t *val);
int32_t ism330dhcx_ln_pg_write(ism330dhcx_ctx_t *ctx, uint16_t address,
                               uint8_t *buf, uint8_t len);
int32_t ism330dhcx_ln_pg_read_byte(ism330dhcx_ctx_t *ctx, uint16_t add,
                                   uint8_t *val);
int32_t ism330dhcx_ln_pg_read(ism330dhcx_ctx_t *ctx, uint16_t address,
                              uint8_t *val);

typedef enum {
  ISM330DHCX_DRDY_LATCHED = 0,
  ISM330DHCX_DRDY_PULSED  = 1,
} ism330dhcx_dataready_pulsed_t;
int32_t ism330dhcx_data_ready_mode_set(ism330dhcx_ctx_t *ctx,
                                       ism330dhcx_dataready_pulsed_t val);
int32_t ism330dhcx_data_ready_mode_get(ism330dhcx_ctx_t *ctx,
                                       ism330dhcx_dataready_pulsed_t *val);

int32_t ism330dhcx_device_id_get(ism330dhcx_ctx_t *ctx, uint8_t *buff);

int32_t ism330dhcx_reset_set(ism330dhcx_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_reset_get(ism330dhcx_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_auto_increment_set(ism330dhcx_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_auto_increment_get(ism330dhcx_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_boot_set(ism330dhcx_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_boot_get(ism330dhcx_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DHCX_XL_ST_DISABLE  = 0,
  ISM330DHCX_XL_ST_POSITIVE = 1,
  ISM330DHCX_XL_ST_NEGATIVE = 2,
} ism330dhcx_st_xl_t;
int32_t ism330dhcx_xl_self_test_set(ism330dhcx_ctx_t *ctx,
                                    ism330dhcx_st_xl_t val);
int32_t ism330dhcx_xl_self_test_get(ism330dhcx_ctx_t *ctx,
                                    ism330dhcx_st_xl_t *val);

typedef enum {
  ISM330DHCX_GY_ST_DISABLE  = 0,
  ISM330DHCX_GY_ST_POSITIVE = 1,
  ISM330DHCX_GY_ST_NEGATIVE = 3,
} ism330dhcx_st_g_t;
int32_t ism330dhcx_gy_self_test_set(ism330dhcx_ctx_t *ctx,
                                    ism330dhcx_st_g_t val);
int32_t ism330dhcx_gy_self_test_get(ism330dhcx_ctx_t *ctx,
                                    ism330dhcx_st_g_t *val);

int32_t ism330dhcx_xl_filter_lp2_set(ism330dhcx_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_xl_filter_lp2_get(ism330dhcx_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_gy_filter_lp1_set(ism330dhcx_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_gy_filter_lp1_get(ism330dhcx_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_filter_settling_mask_set(ism330dhcx_ctx_t *ctx,
                                            uint8_t val);
int32_t ism330dhcx_filter_settling_mask_get(ism330dhcx_ctx_t *ctx,
                                            uint8_t *val);

typedef enum {
  ISM330DHCX_ULTRA_LIGHT  = 0,
  ISM330DHCX_VERY_LIGHT   = 1,
  ISM330DHCX_LIGHT        = 2,
  ISM330DHCX_MEDIUM       = 3,
  ISM330DHCX_STRONG       = 4,
  ISM330DHCX_VERY_STRONG  = 5,
  ISM330DHCX_AGGRESSIVE   = 6,
  ISM330DHCX_XTREME       = 7,
} ism330dhcx_ftype_t;
int32_t ism330dhcx_gy_lp1_bandwidth_set(ism330dhcx_ctx_t *ctx,
                                        ism330dhcx_ftype_t val);
int32_t ism330dhcx_gy_lp1_bandwidth_get(ism330dhcx_ctx_t *ctx,
                                        ism330dhcx_ftype_t *val);

int32_t ism330dhcx_xl_lp2_on_6d_set(ism330dhcx_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_xl_lp2_on_6d_get(ism330dhcx_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DHCX_HP_PATH_DISABLE_ON_OUT    = 0x00,
  ISM330DHCX_SLOPE_ODR_DIV_4           = 0x10,
  ISM330DHCX_HP_ODR_DIV_10             = 0x11,
  ISM330DHCX_HP_ODR_DIV_20             = 0x12,
  ISM330DHCX_HP_ODR_DIV_45             = 0x13,
  ISM330DHCX_HP_ODR_DIV_100            = 0x14,
  ISM330DHCX_HP_ODR_DIV_200            = 0x15,
  ISM330DHCX_HP_ODR_DIV_400            = 0x16,
  ISM330DHCX_HP_ODR_DIV_800            = 0x17,
  ISM330DHCX_HP_REF_MD_ODR_DIV_10      = 0x31,
  ISM330DHCX_HP_REF_MD_ODR_DIV_20      = 0x32,
  ISM330DHCX_HP_REF_MD_ODR_DIV_45      = 0x33,
  ISM330DHCX_HP_REF_MD_ODR_DIV_100     = 0x34,
  ISM330DHCX_HP_REF_MD_ODR_DIV_200     = 0x35,
  ISM330DHCX_HP_REF_MD_ODR_DIV_400     = 0x36,
  ISM330DHCX_HP_REF_MD_ODR_DIV_800     = 0x37,
  ISM330DHCX_LP_ODR_DIV_10             = 0x01,
  ISM330DHCX_LP_ODR_DIV_20             = 0x02,
  ISM330DHCX_LP_ODR_DIV_45             = 0x03,
  ISM330DHCX_LP_ODR_DIV_100            = 0x04,
  ISM330DHCX_LP_ODR_DIV_200            = 0x05,
  ISM330DHCX_LP_ODR_DIV_400            = 0x06,
  ISM330DHCX_LP_ODR_DIV_800            = 0x07,
} ism330dhcx_hp_slope_xl_en_t;
int32_t ism330dhcx_xl_hp_path_on_out_set(ism330dhcx_ctx_t *ctx,
                                         ism330dhcx_hp_slope_xl_en_t val);
int32_t ism330dhcx_xl_hp_path_on_out_get(ism330dhcx_ctx_t *ctx,
                                         ism330dhcx_hp_slope_xl_en_t *val);

int32_t ism330dhcx_xl_fast_settling_set(ism330dhcx_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_xl_fast_settling_get(ism330dhcx_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DHCX_USE_SLOPE = 0,
  ISM330DHCX_USE_HPF   = 1,
} ism330dhcx_slope_fds_t;
int32_t ism330dhcx_xl_hp_path_internal_set(ism330dhcx_ctx_t *ctx,
                                           ism330dhcx_slope_fds_t val);
int32_t ism330dhcx_xl_hp_path_internal_get(ism330dhcx_ctx_t *ctx,
                                           ism330dhcx_slope_fds_t *val);

typedef enum {
  ISM330DHCX_HP_FILTER_NONE     = 0x00,
  ISM330DHCX_HP_FILTER_16mHz    = 0x80,
  ISM330DHCX_HP_FILTER_65mHz    = 0x81,
  ISM330DHCX_HP_FILTER_260mHz   = 0x82,
  ISM330DHCX_HP_FILTER_1Hz04    = 0x83,
} ism330dhcx_hpm_g_t;
int32_t ism330dhcx_gy_hp_path_internal_set(ism330dhcx_ctx_t *ctx,
                                           ism330dhcx_hpm_g_t val);
int32_t ism330dhcx_gy_hp_path_internal_get(ism330dhcx_ctx_t *ctx,
                                           ism330dhcx_hpm_g_t *val);

