stm32duino/ISM330DHCX/src/ism330dhcx_reg.h
typedef enum {
  ISM330DHCX_AUX_PULL_UP_DISC       = 0,
  ISM330DHCX_AUX_PULL_UP_CONNECT    = 1,
} ism330dhcx_ois_pu_dis_t;
int32_t ism330dhcx_aux_sdo_ocs_mode_set(ism330dhcx_ctx_t *ctx,
                                        ism330dhcx_ois_pu_dis_t val);
int32_t ism330dhcx_aux_sdo_ocs_mode_get(ism330dhcx_ctx_t *ctx,
                                        ism330dhcx_ois_pu_dis_t *val);

typedef enum {
  ISM330DHCX_AUX_ON                    = 1,
  ISM330DHCX_AUX_ON_BY_AUX_INTERFACE   = 0,
} ism330dhcx_ois_on_t;
int32_t ism330dhcx_aux_pw_on_ctrl_set(ism330dhcx_ctx_t *ctx,
                                      ism330dhcx_ois_on_t val);
int32_t ism330dhcx_aux_pw_on_ctrl_get(ism330dhcx_ctx_t *ctx,
                                      ism330dhcx_ois_on_t *val);

int32_t ism330dhcx_aux_status_reg_get(ism330dhcx_ctx_t *ctx,
                                      ism330dhcx_status_spiaux_t *val);

int32_t ism330dhcx_aux_xl_flag_data_ready_get(ism330dhcx_ctx_t *ctx,
                                              uint8_t *val);

int32_t ism330dhcx_aux_gy_flag_data_ready_get(ism330dhcx_ctx_t *ctx,
                                              uint8_t *val);

int32_t ism330dhcx_aux_gy_flag_settling_get(ism330dhcx_ctx_t *ctx,
                                            uint8_t *val);

typedef enum {
  ISM330DHCX_AUX_XL_DISABLE = 0,
  ISM330DHCX_AUX_XL_POS     = 1,
  ISM330DHCX_AUX_XL_NEG     = 2,
} ism330dhcx_st_xl_ois_t;
int32_t ism330dhcx_aux_xl_self_test_set(ism330dhcx_ctx_t *ctx,
                                        ism330dhcx_st_xl_ois_t val);
int32_t ism330dhcx_aux_xl_self_test_get(ism330dhcx_ctx_t *ctx,
                                        ism330dhcx_st_xl_ois_t *val);

typedef enum {
  ISM330DHCX_AUX_DEN_ACTIVE_LOW     = 0,
  ISM330DHCX_AUX_DEN_ACTIVE_HIGH    = 1,
} ism330dhcx_den_lh_ois_t;
int32_t ism330dhcx_aux_den_polarity_set(ism330dhcx_ctx_t *ctx,
                                        ism330dhcx_den_lh_ois_t val);
int32_t ism330dhcx_aux_den_polarity_get(ism330dhcx_ctx_t *ctx,
                                        ism330dhcx_den_lh_ois_t *val);

typedef enum {
  ISM330DHCX_AUX_DEN_DISABLE         = 0,
  ISM330DHCX_AUX_DEN_LEVEL_LATCH     = 3,
  ISM330DHCX_AUX_DEN_LEVEL_TRIG      = 2,
} ism330dhcx_lvl2_ois_t;
int32_t ism330dhcx_aux_den_mode_set(ism330dhcx_ctx_t *ctx,
                                    ism330dhcx_lvl2_ois_t val);
int32_t ism330dhcx_aux_den_mode_get(ism330dhcx_ctx_t *ctx,
                                    ism330dhcx_lvl2_ois_t *val);

int32_t ism330dhcx_aux_drdy_on_int2_set(ism330dhcx_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_aux_drdy_on_int2_get(ism330dhcx_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DHCX_AUX_DISABLE  = 0,
  ISM330DHCX_MODE_3_GY    = 1,
  ISM330DHCX_MODE_4_GY_XL = 3,
} ism330dhcx_ois_en_spi2_t;
int32_t ism330dhcx_aux_mode_set(ism330dhcx_ctx_t *ctx,
                                ism330dhcx_ois_en_spi2_t val);
int32_t ism330dhcx_aux_mode_get(ism330dhcx_ctx_t *ctx,
                                ism330dhcx_ois_en_spi2_t *val);

typedef enum {
  ISM330DHCX_125dps_AUX  =  0x04,
  ISM330DHCX_250dps_AUX  =  0x00,
  ISM330DHCX_500dps_AUX  =  0x01,
  ISM330DHCX_1000dps_AUX =  0x02,
  ISM330DHCX_2000dps_AUX =  0x03,
} ism330dhcx_fs_g_ois_t;
int32_t ism330dhcx_aux_gy_full_scale_set(ism330dhcx_ctx_t *ctx,
                                         ism330dhcx_fs_g_ois_t val);
int32_t ism330dhcx_aux_gy_full_scale_get(ism330dhcx_ctx_t *ctx,
                                         ism330dhcx_fs_g_ois_t *val);

typedef enum {
  ISM330DHCX_AUX_SPI_4_WIRE = 0,
  ISM330DHCX_AUX_SPI_3_WIRE = 1,
} ism330dhcx_sim_ois_t;
int32_t ism330dhcx_aux_spi_mode_set(ism330dhcx_ctx_t *ctx,
                                    ism330dhcx_sim_ois_t val);
int32_t ism330dhcx_aux_spi_mode_get(ism330dhcx_ctx_t *ctx,
                                    ism330dhcx_sim_ois_t *val);

typedef enum {
  ISM330DHCX_351Hz39 = 0,
  ISM330DHCX_236Hz63 = 1,
  ISM330DHCX_172Hz70 = 2,
  ISM330DHCX_937Hz91 = 3,
} ism330dhcx_ftype_ois_t;
int32_t ism330dhcx_aux_gy_lp1_bandwidth_set(ism330dhcx_ctx_t *ctx,
                                            ism330dhcx_ftype_ois_t val);
int32_t ism330dhcx_aux_gy_lp1_bandwidth_get(ism330dhcx_ctx_t *ctx,
                                            ism330dhcx_ftype_ois_t *val);

typedef enum {
  ISM330DHCX_AUX_HP_DISABLE = 0x00,
  ISM330DHCX_AUX_HP_Hz016   = 0x10,
  ISM330DHCX_AUX_HP_Hz065   = 0x11,
  ISM330DHCX_AUX_HP_Hz260   = 0x12,
  ISM330DHCX_AUX_HP_1Hz040  = 0x13,
} ism330dhcx_hpm_ois_t;
int32_t ism330dhcx_aux_gy_hp_bandwidth_set(ism330dhcx_ctx_t *ctx,
                                           ism330dhcx_hpm_ois_t val);
int32_t ism330dhcx_aux_gy_hp_bandwidth_get(ism330dhcx_ctx_t *ctx,
                                           ism330dhcx_hpm_ois_t *val);

typedef enum {
  ISM330DHCX_ENABLE_CLAMP  = 0,
  ISM330DHCX_DISABLE_CLAMP = 1,
} ism330dhcx_st_ois_clampdis_t;
int32_t ism330dhcx_aux_gy_clamp_set(ism330dhcx_ctx_t *ctx,
                                    ism330dhcx_st_ois_clampdis_t val);
int32_t ism330dhcx_aux_gy_clamp_get(ism330dhcx_ctx_t *ctx,
                                    ism330dhcx_st_ois_clampdis_t *val);

typedef enum {
  ISM330DHCX_AUX_GY_DISABLE = 0,
  ISM330DHCX_AUX_GY_POS     = 1,
  ISM330DHCX_AUX_GY_NEG     = 3,
} ism330dhcx_st_ois_t;
int32_t ism330dhcx_aux_gy_self_test_set(ism330dhcx_ctx_t *ctx,
                                        ism330dhcx_st_ois_t val);
int32_t ism330dhcx_aux_gy_self_test_get(ism330dhcx_ctx_t *ctx,
                                        ism330dhcx_st_ois_t *val);

typedef enum {
  ISM330DHCX_631Hz = 0,
  ISM330DHCX_295Hz = 1,
  ISM330DHCX_140Hz = 2,
  ISM330DHCX_68Hz2 = 3,
  ISM330DHCX_33Hz6 = 4,
  ISM330DHCX_16Hz7 = 5,
  ISM330DHCX_8Hz3  = 6,
  ISM330DHCX_4Hz11 = 7,
} ism330dhcx_filter_xl_conf_ois_t;
int32_t ism330dhcx_aux_xl_bandwidth_set(ism330dhcx_ctx_t *ctx,
                                        ism330dhcx_filter_xl_conf_ois_t val);
int32_t ism330dhcx_aux_xl_bandwidth_get(ism330dhcx_ctx_t *ctx,
                                        ism330dhcx_filter_xl_conf_ois_t *val);

