stm32duino/ISM330DHCX/src/ism330dhcx_reg.h
int32_t ism330dhcx_tap_detection_on_y_set(ism330dhcx_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_tap_detection_on_y_get(ism330dhcx_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_tap_detection_on_x_set(ism330dhcx_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_tap_detection_on_x_get(ism330dhcx_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_tap_threshold_x_set(ism330dhcx_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_tap_threshold_x_get(ism330dhcx_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DHCX_XYZ = 0,
  ISM330DHCX_YXZ = 1,
  ISM330DHCX_XZY = 2,
  ISM330DHCX_ZYX = 3,
  ISM330DHCX_YZX = 5,
  ISM330DHCX_ZXY = 6,
} ism330dhcx_tap_priority_t;
int32_t ism330dhcx_tap_axis_priority_set(ism330dhcx_ctx_t *ctx,
                                         ism330dhcx_tap_priority_t val);
int32_t ism330dhcx_tap_axis_priority_get(ism330dhcx_ctx_t *ctx,
                                         ism330dhcx_tap_priority_t *val);

int32_t ism330dhcx_tap_threshold_y_set(ism330dhcx_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_tap_threshold_y_get(ism330dhcx_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_tap_threshold_z_set(ism330dhcx_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_tap_threshold_z_get(ism330dhcx_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_tap_shock_set(ism330dhcx_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_tap_shock_get(ism330dhcx_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_tap_quiet_set(ism330dhcx_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_tap_quiet_get(ism330dhcx_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_tap_dur_set(ism330dhcx_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_tap_dur_get(ism330dhcx_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DHCX_ONLY_SINGLE        = 0,
  ISM330DHCX_BOTH_SINGLE_DOUBLE = 1,
} ism330dhcx_single_double_tap_t;
int32_t ism330dhcx_tap_mode_set(ism330dhcx_ctx_t *ctx,
                                ism330dhcx_single_double_tap_t val);
int32_t ism330dhcx_tap_mode_get(ism330dhcx_ctx_t *ctx,
                                ism330dhcx_single_double_tap_t *val);

typedef enum {
  ISM330DHCX_DEG_80  = 0,
  ISM330DHCX_DEG_70  = 1,
  ISM330DHCX_DEG_60  = 2,
  ISM330DHCX_DEG_50  = 3,
} ism330dhcx_sixd_ths_t;
int32_t ism330dhcx_6d_threshold_set(ism330dhcx_ctx_t *ctx,
                                    ism330dhcx_sixd_ths_t val);
int32_t ism330dhcx_6d_threshold_get(ism330dhcx_ctx_t *ctx,
                                    ism330dhcx_sixd_ths_t *val);

int32_t ism330dhcx_4d_mode_set(ism330dhcx_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_4d_mode_get(ism330dhcx_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DHCX_FF_TSH_156mg = 0,
  ISM330DHCX_FF_TSH_219mg = 1,
  ISM330DHCX_FF_TSH_250mg = 2,
  ISM330DHCX_FF_TSH_312mg = 3,
  ISM330DHCX_FF_TSH_344mg = 4,
  ISM330DHCX_FF_TSH_406mg = 5,
  ISM330DHCX_FF_TSH_469mg = 6,
  ISM330DHCX_FF_TSH_500mg = 7,
} ism330dhcx_ff_ths_t;
int32_t ism330dhcx_ff_threshold_set(ism330dhcx_ctx_t *ctx,
                                    ism330dhcx_ff_ths_t val);
int32_t ism330dhcx_ff_threshold_get(ism330dhcx_ctx_t *ctx,
                                    ism330dhcx_ff_ths_t *val);

int32_t ism330dhcx_ff_dur_set(ism330dhcx_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_ff_dur_get(ism330dhcx_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_fifo_watermark_set(ism330dhcx_ctx_t *ctx, uint16_t val);
int32_t ism330dhcx_fifo_watermark_get(ism330dhcx_ctx_t *ctx, uint16_t *val);

int32_t ism330dhcx_compression_algo_init_set(ism330dhcx_ctx_t *ctx,
                                             uint8_t val);
int32_t ism330dhcx_compression_algo_init_get(ism330dhcx_ctx_t *ctx,
                                             uint8_t *val);

typedef enum {
  ISM330DHCX_CMP_DISABLE  = 0x00,
  ISM330DHCX_CMP_ALWAYS   = 0x04,
  ISM330DHCX_CMP_8_TO_1   = 0x05,
  ISM330DHCX_CMP_16_TO_1  = 0x06,
  ISM330DHCX_CMP_32_TO_1  = 0x07,
} ism330dhcx_uncoptr_rate_t;
int32_t ism330dhcx_compression_algo_set(ism330dhcx_ctx_t *ctx,
                                        ism330dhcx_uncoptr_rate_t val);
int32_t ism330dhcx_compression_algo_get(ism330dhcx_ctx_t *ctx,
                                        ism330dhcx_uncoptr_rate_t *val);

int32_t ism330dhcx_fifo_virtual_sens_odr_chg_set(ism330dhcx_ctx_t *ctx,
                                                 uint8_t val);
int32_t ism330dhcx_fifo_virtual_sens_odr_chg_get(ism330dhcx_ctx_t *ctx,
                                                 uint8_t *val);

int32_t ism330dhcx_compression_algo_real_time_set(ism330dhcx_ctx_t *ctx,
                                                  uint8_t val);
int32_t ism330dhcx_compression_algo_real_time_get(ism330dhcx_ctx_t *ctx,
                                                  uint8_t *val);

int32_t ism330dhcx_fifo_stop_on_wtm_set(ism330dhcx_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_fifo_stop_on_wtm_get(ism330dhcx_ctx_t *ctx, uint8_t *val);

typedef enum {
  ISM330DHCX_XL_NOT_BATCHED       =  0,
  ISM330DHCX_XL_BATCHED_AT_12Hz5   =  1,
  ISM330DHCX_XL_BATCHED_AT_26Hz    =  2,
  ISM330DHCX_XL_BATCHED_AT_52Hz    =  3,
  ISM330DHCX_XL_BATCHED_AT_104Hz   =  4,
  ISM330DHCX_XL_BATCHED_AT_208Hz   =  5,
  ISM330DHCX_XL_BATCHED_AT_417Hz   =  6,
  ISM330DHCX_XL_BATCHED_AT_833Hz   =  7,
  ISM330DHCX_XL_BATCHED_AT_1667Hz  =  8,
  ISM330DHCX_XL_BATCHED_AT_3333Hz  =  9,
  ISM330DHCX_XL_BATCHED_AT_6667Hz  = 10,
  ISM330DHCX_XL_BATCHED_AT_6Hz5    = 11,
} ism330dhcx_bdr_xl_t;
int32_t ism330dhcx_fifo_xl_batch_set(ism330dhcx_ctx_t *ctx,
                                     ism330dhcx_bdr_xl_t val);
int32_t ism330dhcx_fifo_xl_batch_get(ism330dhcx_ctx_t *ctx,
                                     ism330dhcx_bdr_xl_t *val);

typedef enum {
  ISM330DHCX_GY_NOT_BATCHED         = 0,
  ISM330DHCX_GY_BATCHED_AT_12Hz5    = 1,
  ISM330DHCX_GY_BATCHED_AT_26Hz     = 2,
  ISM330DHCX_GY_BATCHED_AT_52Hz     = 3,
  ISM330DHCX_GY_BATCHED_AT_104Hz    = 4,
  ISM330DHCX_GY_BATCHED_AT_208Hz    = 5,
  ISM330DHCX_GY_BATCHED_AT_417Hz    = 6,
  ISM330DHCX_GY_BATCHED_AT_833Hz    = 7,
  ISM330DHCX_GY_BATCHED_AT_1667Hz   = 8,
  ISM330DHCX_GY_BATCHED_AT_3333Hz   = 9,
  ISM330DHCX_GY_BATCHED_AT_6667Hz   = 10,
  ISM330DHCX_GY_BATCHED_6Hz5        = 11,
} ism330dhcx_bdr_gy_t;
int32_t ism330dhcx_fifo_gy_batch_set(ism330dhcx_ctx_t *ctx,
                                     ism330dhcx_bdr_gy_t val);
int32_t ism330dhcx_fifo_gy_batch_get(ism330dhcx_ctx_t *ctx,
                                     ism330dhcx_bdr_gy_t *val);

