stm32duino/ISM330DHCX/src/ism330dhcx_reg.h
typedef enum {
  ISM330DHCX_PEDO_BASE                = 0x00,
  ISM330DHCX_PEDO_BASE_FALSE_STEP_REJ = 0x01,
  ISM330DHCX_PEDO_ADV_FALSE_STEP_REJ  = 0x03,
} ism330dhcx_pedo_mode_t;
int32_t ism330dhcx_pedo_mode_set(ism330dhcx_ctx_t *ctx,
                                 ism330dhcx_pedo_mode_t val);
int32_t ism330dhcx_pedo_mode_get(ism330dhcx_ctx_t *ctx,
                                 ism330dhcx_pedo_mode_t *val);

int32_t ism330dhcx_pedo_step_detect_get(ism330dhcx_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_pedo_debounce_steps_set(ism330dhcx_ctx_t *ctx,
                                           uint8_t *buff);
int32_t ism330dhcx_pedo_debounce_steps_get(ism330dhcx_ctx_t *ctx,
                                           uint8_t *buff);

int32_t ism330dhcx_pedo_steps_period_set(ism330dhcx_ctx_t *ctx, uint8_t *buff);
int32_t ism330dhcx_pedo_steps_period_get(ism330dhcx_ctx_t *ctx, uint8_t *buff);

int32_t ism330dhcx_pedo_adv_detection_set(ism330dhcx_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_pedo_adv_detection_get(ism330dhcx_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_pedo_false_step_rejection_set(ism330dhcx_ctx_t *ctx,
                                                 uint8_t val);
int32_t ism330dhcx_pedo_false_step_rejection_get(ism330dhcx_ctx_t *ctx,
                                                 uint8_t *val);

typedef enum {
  ISM330DHCX_EVERY_STEP     = 0,
  ISM330DHCX_COUNT_OVERFLOW = 1,
} ism330dhcx_carry_count_en_t;
int32_t ism330dhcx_pedo_int_mode_set(ism330dhcx_ctx_t *ctx,
                                     ism330dhcx_carry_count_en_t val);
int32_t ism330dhcx_pedo_int_mode_get(ism330dhcx_ctx_t *ctx,
                                     ism330dhcx_carry_count_en_t *val);

int32_t ism330dhcx_motion_sens_set(ism330dhcx_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_motion_sens_get(ism330dhcx_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_motion_flag_data_ready_get(ism330dhcx_ctx_t *ctx,
                                              uint8_t *val);

int32_t ism330dhcx_tilt_sens_set(ism330dhcx_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_tilt_sens_get(ism330dhcx_ctx_t *ctx, uint8_t *val);

int32_t ism330dhcx_tilt_flag_data_ready_get(ism330dhcx_ctx_t *ctx,
                                            uint8_t *val);

int32_t ism330dhcx_mag_sensitivity_set(ism330dhcx_ctx_t *ctx, uint8_t *buff);
int32_t ism330dhcx_mag_sensitivity_get(ism330dhcx_ctx_t *ctx, uint8_t *buff);

int32_t ism330dhcx_mag_offset_set(ism330dhcx_ctx_t *ctx, uint8_t *buff);
int32_t ism330dhcx_mag_offset_get(ism330dhcx_ctx_t *ctx, uint8_t *buff);

int32_t ism330dhcx_mag_soft_iron_set(ism330dhcx_ctx_t *ctx, uint8_t *buff);
int32_t ism330dhcx_mag_soft_iron_get(ism330dhcx_ctx_t *ctx, uint8_t *buff);

typedef enum {
  ISM330DHCX_Z_EQ_Y     = 0,
  ISM330DHCX_Z_EQ_MIN_Y = 1,
  ISM330DHCX_Z_EQ_X     = 2,
  ISM330DHCX_Z_EQ_MIN_X = 3,
  ISM330DHCX_Z_EQ_MIN_Z = 4,
  ISM330DHCX_Z_EQ_Z     = 5,
} ism330dhcx_mag_z_axis_t;
int32_t ism330dhcx_mag_z_orient_set(ism330dhcx_ctx_t *ctx,
                                    ism330dhcx_mag_z_axis_t val);
int32_t ism330dhcx_mag_z_orient_get(ism330dhcx_ctx_t *ctx,
                                    ism330dhcx_mag_z_axis_t *val);

typedef enum {
  ISM330DHCX_Y_EQ_Y     = 0,
  ISM330DHCX_Y_EQ_MIN_Y = 1,
  ISM330DHCX_Y_EQ_X     = 2,
  ISM330DHCX_Y_EQ_MIN_X = 3,
  ISM330DHCX_Y_EQ_MIN_Z = 4,
  ISM330DHCX_Y_EQ_Z     = 5,
} ism330dhcx_mag_y_axis_t;
int32_t ism330dhcx_mag_y_orient_set(ism330dhcx_ctx_t *ctx,
                                    ism330dhcx_mag_y_axis_t val);
int32_t ism330dhcx_mag_y_orient_get(ism330dhcx_ctx_t *ctx,
                                    ism330dhcx_mag_y_axis_t *val);

typedef enum {
  ISM330DHCX_X_EQ_Y     = 0,
  ISM330DHCX_X_EQ_MIN_Y = 1,
  ISM330DHCX_X_EQ_X     = 2,
  ISM330DHCX_X_EQ_MIN_X = 3,
  ISM330DHCX_X_EQ_MIN_Z = 4,
  ISM330DHCX_X_EQ_Z     = 5,
} ism330dhcx_mag_x_axis_t;
int32_t ism330dhcx_mag_x_orient_set(ism330dhcx_ctx_t *ctx,
                                    ism330dhcx_mag_x_axis_t val);
int32_t ism330dhcx_mag_x_orient_get(ism330dhcx_ctx_t *ctx,
                                    ism330dhcx_mag_x_axis_t *val);

int32_t ism330dhcx_long_cnt_flag_data_ready_get(ism330dhcx_ctx_t *ctx,
                                                uint8_t *val);

int32_t ism330dhcx_emb_fsm_en_set(ism330dhcx_ctx_t *ctx, uint8_t val);
int32_t ism330dhcx_emb_fsm_en_get(ism330dhcx_ctx_t *ctx, uint8_t *val);

typedef struct {
  ism330dhcx_fsm_enable_a_t          fsm_enable_a;
  ism330dhcx_fsm_enable_b_t          fsm_enable_b;
} ism330dhcx_emb_fsm_enable_t;
int32_t ism330dhcx_fsm_enable_set(ism330dhcx_ctx_t *ctx,
                                  ism330dhcx_emb_fsm_enable_t *val);
int32_t ism330dhcx_fsm_enable_get(ism330dhcx_ctx_t *ctx,
                                  ism330dhcx_emb_fsm_enable_t *val);

int32_t ism330dhcx_long_cnt_set(ism330dhcx_ctx_t *ctx, uint8_t *buff);
int32_t ism330dhcx_long_cnt_get(ism330dhcx_ctx_t *ctx, uint8_t *buff);

typedef enum {
  ISM330DHCX_LC_NORMAL     = 0,
  ISM330DHCX_LC_CLEAR      = 1,
  ISM330DHCX_LC_CLEAR_DONE = 2,
} ism330dhcx_fsm_lc_clr_t;
int32_t ism330dhcx_long_clr_set(ism330dhcx_ctx_t *ctx,
                                ism330dhcx_fsm_lc_clr_t val);
int32_t ism330dhcx_long_clr_get(ism330dhcx_ctx_t *ctx,
                                ism330dhcx_fsm_lc_clr_t *val);

typedef struct {
  ism330dhcx_fsm_outs1_t    fsm_outs1;
  ism330dhcx_fsm_outs2_t    fsm_outs2;
  ism330dhcx_fsm_outs3_t    fsm_outs3;
  ism330dhcx_fsm_outs4_t    fsm_outs4;
  ism330dhcx_fsm_outs5_t    fsm_outs5;
  ism330dhcx_fsm_outs6_t    fsm_outs6;
  ism330dhcx_fsm_outs7_t    fsm_outs7;
  ism330dhcx_fsm_outs8_t    fsm_outs8;
  ism330dhcx_fsm_outs9_t    fsm_outs9;
  ism330dhcx_fsm_outs10_t    fsm_outs10;
  ism330dhcx_fsm_outs11_t    fsm_outs11;
  ism330dhcx_fsm_outs12_t    fsm_outs12;
  ism330dhcx_fsm_outs13_t    fsm_outs13;
  ism330dhcx_fsm_outs14_t    fsm_outs14;
  ism330dhcx_fsm_outs15_t    fsm_outs15;
  ism330dhcx_fsm_outs16_t    fsm_outs16;
} ism330dhcx_fsm_out_t;
